blog/progress.html
<!DOCTYPE html>
<html>
<head>
<title>進捗報告会について</title>
<!-- 2018-06-10 Sun 06:39 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="/css/prelude.css" />
<link rel="stylesheet" type="text/css" href="/css/highlight.css" />
</head>
<body>
<div id="content">
<h1 class="title">進捗報告会について</h1>
<div class="location">
<p>
https://<a href="/">bydriv.github.io</a>/<a href="/blog">blog</a>/<strong>progress.html</strong>
</p>

</div>

<div class="created_at">
<p>
created at <time datetime="2018-06-10">2018-06-10</time>
</p>

</div>

<div class="updated_at">
<p>
updated at <time datetime="2018-06-10">2018-06-10</time>
</p>

</div>

<p>
進捗報告会について．
</p>

<p>
最近， <a href="https://fantia.jp/bydriv">https://fantia.jp/bydriv</a> というものにたびたび記事を書く．
もともとこのサイトはダウンロード商品などを販売する……みたいなサイトなんだけど，
ファンのみに記事を公開できたりして世界全体に発信するほどでもないけど読んでもらいたい，
みたいな使い方ができて使い勝手がいいので， いまのところ，そういう使い方をしている．
</p>

<p>
今年の2月ころ，某氏とプロジェクト管理について話す機会があった．で，まあいろいろテクいことはあるけど，
やっぱり進捗を定期的に報告する場所があることはひとつの要因として重要だよね，みたいな話になった．
</p>

<p>
最初， Discord みたいなサイトでやろうという話があったのだけど，
わたしは正直， それは続かないと思っていた．
ほかのひとはわからないけど， どうにもわたしはそういう，
"特定の場に集まる" ツールは苦手なのだと思っていた． Twitter
もブログもそうだけど， 基本的には "一方的に発信する", そして "見たいひとが見る"
というツールである． こういうほうがわたしの性にあってる．
</p>

<p>
とはいえ， 進捗を報告する場は重要だよねというのは感じていて，
そういう場としてファンティアはそれなりに有用かなあ， と感じていたのだった．
</p>

<p>
ついでのことだからプロジェクト管理について話すと，
正直， 趣味のプロジェクト管理と仕事のプロジェクト管理はだいぶ毛色が違う．
仕事は給料が支払われるわけだから，基本的に外発的動機づけでおこなうものである．
趣味は基本的に内発的動機づけでプロジェクト管理を管理する必要がある．
要するに仕事の場合，やる気がでないという状態でもお金が入ってくるという動機があるからやる．
趣味の場合，やる気がでないと動機が完全になくなってしまう．
これが趣味のプロジェクト管理の根本的な難しさだと思う．
</p>

<p>
じゃあ，趣味でプロジェクト管理することは完全にやる気依存なのか？
ううむ，どうにもそういうわけではないようだ．
趣味でやるプロジェクトをうまく進める方法は，
動機をうまく分散させておいて，常に動機が絶えないようにするのがコツだと思う．
</p>

<p>
先に述べたことはその手段のひとつで，たとえば進捗を報告する，
そのためにやるというのはひとつの動機になる．もちろん，
これは諸刃の剣でもあって，まったく反応がなくてやる気が完全に失われてしまう，
というのが最悪のパターンだと思う．まあでも，
単にやったことを日記のように書くだけでもそれなりに効果はある．
日記に書きたいからやる，という動機ができるわけだから．
</p>

<p>
まあそんな感じでわたしのなかでは進捗報告会はそれくらい (週1とか，そういう定期的にじゃなくて)
ゆるゆるとやっていければいいなみたいなことを思っていたりしたのでした．
</p>
</div>
</body>
</html>
